Hi @cliftonvella ,

As described in the document: [fortios_system_interface](https://registry.terraform.io/providers/fortinetdev/fortios/latest/docs/resources/fortios_system_interface) : _autogenerated-Indicates whether the interface is automatically created by FortiGate._

`autogenerated` should be added to your auto-generated interface configuration.

**Validation:**
``` hcl
provider "fortios" {
  hostname = "192.168.52.177"
  insecure = "true"
  token    = "GNH7r40H65GNb46kd4rG8rtrmn0fr1"
}


variable "vdoms" {
  type = map(any)
  default = {
    vdom1 = {
      product_code = "P112"
      subnet = "10.146.0.0/19"
    }
    vdom2 = {
      product_code = "P111"
      subnet = "10.146.32.0/20"
    }
    vdom3 = {
      product_code = "S111"
      subnet = "10.146.48.0/20"
    }
  }
}

resource "fortios_system_vdomlink" "create_vdomlinks" {
  for_each = var.vdoms
  name = "${each.value.product_code}-shared"
}

resource "fortios_system_interface" "vdomlink_vdoms" {
  for_each = var.vdoms
  type = "vdom-link"
  vdom = "${each.value.product_code}"
  name = "${each.value.product_code}-shared1"
  autogenerated = "auto"

  depends_on = [fortios_system_vdomlink.create_vdomlinks]
}

```

```
# terraform apply
fortios_system_vdomlink.create_vdomlinks["vdom1"]: Refreshing state... [id=P112-shared]
fortios_system_vdomlink.create_vdomlinks["vdom2"]: Refreshing state... [id=P111-shared]
fortios_system_vdomlink.create_vdomlinks["vdom3"]: Refreshing state... [id=S111-shared]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # fortios_system_interface.vdomlink_vdoms["vdom1"] will be created
  + resource "fortios_system_interface" "vdomlink_vdoms" {
      + ac_name                                    = (known after apply)
      + aggregate                                  = (known after apply)
      + algorithm                                  = (known after apply)
      + alias                                      = (known after apply)
      + allowaccess                                = (known after apply)
      + ap_discover                                = (known after apply)
      + arpforward                                 = (known after apply)
      + auth_type                                  = (known after apply)
      + auto_auth_extension_device                 = (known after apply)
      + autogenerated                              = "auto"
      + bandwidth_measure_time                     = (known after apply)
	...........................
      + weight                                     = (known after apply)
      + wins_ip                                    = (known after apply)
    }

  # fortios_system_interface.vdomlink_vdoms["vdom2"] will be created
  + resource "fortios_system_interface" "vdomlink_vdoms" {
      + ac_name                                    = (known after apply)
      + aggregate                                  = (known after apply)
      + algorithm                                  = (known after apply)
      + alias                                      = (known after apply)
      + allowaccess                                = (known after apply)
      + ap_discover                                = (known after apply)
      + arpforward                                 = (known after apply)
      + auth_type                                  = (known after apply)
      + auto_auth_extension_device                 = (known after apply)
      + autogenerated                              = "auto"
      + bandwidth_measure_time                     = (known after apply)
      + bfd                                        = (known after apply)
      + bfd_desired_min_tx                         = (known after apply)
	...........................
      + vlanid                                     = (known after apply)
      + vrf                                        = (known after apply)
      + vrrp_virtual_mac                           = (known after apply)
      + wccp                                       = (known after apply)
      + weight                                     = (known after apply)
      + wins_ip                                    = (known after apply)
    }

  # fortios_system_interface.vdomlink_vdoms["vdom3"] will be created
  + resource "fortios_system_interface" "vdomlink_vdoms" {
      + ac_name                                    = (known after apply)
      + aggregate                                  = (known after apply)
      + algorithm                                  = (known after apply)
      + alias                                      = (known after apply)
      + allowaccess                                = (known after apply)
      + ap_discover                                = (known after apply)
      + arpforward                                 = (known after apply)
      + auth_type                                  = (known after apply)
      + auto_auth_extension_device                 = (known after apply)
      + autogenerated                              = "auto"
      + bandwidth_measure_time                     = (known after apply)
      + bfd                                        = (known after apply)
      + bfd_desired_min_tx                         = (known after apply)
      + bfd_detect_mult                            = (known after apply)
      + bfd_required_min_rx                        = (known after apply)
 	...........................

      + wccp                                       = (known after apply)
      + weight                                     = (known after apply)
      + wins_ip                                    = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

fortios_system_interface.vdomlink_vdoms["vdom3"]: Creating...
fortios_system_interface.vdomlink_vdoms["vdom2"]: Creating...
fortios_system_interface.vdomlink_vdoms["vdom1"]: Creating...
fortios_system_interface.vdomlink_vdoms["vdom3"]: Creation complete after 0s [id=S111-shared1]
fortios_system_interface.vdomlink_vdoms["vdom2"]: Creation complete after 0s [id=P111-shared1]
fortios_system_interface.vdomlink_vdoms["vdom1"]: Creation complete after 0s [id=P112-shared1]

Apply complete! Resources: 3 added, 0 changed, 0 destroyed.
```

```
# terraform plan
2021/06/14 02:37:48 [WARN] Log levels other than TRACE are currently unreliable, and are supported only for backward compatibility.
  Use TF_LOG=TRACE to see Terraform's internal logs.
  ----
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

fortios_system_interface.vdomlink_vdoms["vdom2"]: Refreshing state... [id=P111-shared1]
fortios_system_interface.vdomlink_vdoms["vdom3"]: Refreshing state... [id=S111-shared1]
fortios_system_vdomlink.create_vdomlinks["vdom2"]: Refreshing state... [id=P111-shared]
fortios_system_vdomlink.create_vdomlinks["vdom3"]: Refreshing state... [id=S111-shared]
fortios_system_vdomlink.create_vdomlinks["vdom1"]: Refreshing state... [id=P112-shared]
fortios_system_interface.vdomlink_vdoms["vdom1"]: Refreshing state... [id=P112-shared1]

------------------------------------------------------------------------

No changes. Infrastructure is up-to-date.

This means that Terraform did not detect any differences between your
configuration and real physical resources that exist. As a result, no
actions need to be performed.
```

**_Result:_**
![1](https://user-images.githubusercontent.com/49291382/121853609-f78fd200-cca5-11eb-83f1-d691d35e69e9.png)

Thanks!
